tutorials/mesh/parallel/filter/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.0938;

boundaryField
{
    walls
    {
        type            kqRWallFunction;
        value           uniform 0.0938;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0.0938;
    }

    outlet
    {
        type            zeroGradient;
    }

    cycLeft_half0
    {
        type            cyclic;
    }

    cycRight_half0
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }

    cycLeft_half1
    {
        type            cyclic;
    }

    cycRight_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
